### **<u>Исходное описание задачи:</u>** *написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.* 

### **<u>Решение:</u>** 
*1. Ввести массив данных с клавиатуры. Для этого реализован метод str_array:
`string[] str_array(int s)          //заполнение массива вводом с консоли
{
    int i;
    string[] str1 = new string[s];
    for (i = 0; i < s; i++)
    {
        Console.Write($"Введите элемент массива [{i}]:  ");
        str1[i] = Console.ReadLine();
    }
    return str1;
}`*\
*2. Выполнить проверку каждого элеменета введеннго массима на количесво символов. В случае, если условия выполняется, добавить элемент в новый список. После заполнения списка новыми элементами, провести их вывод в консаль.Для этого реализован метод slist:
`{
    List<string> str1 = new List<string> ();
    int s=array.Length;
    for (int i = 0; i < s; i++)
    {
        if ((array[i].Length)<=3) 
        {
            str1.Add(array[i]); 
        }
   }
    Console.WriteLine();
    int slist=str1.Count;
    for (int i = 0; i < slist; i++)
    {
        Console.Write($"{str1[i]}  ");
    }
    if (str1.Count==0) Console.Write($"Элементы нужной длинны в массиве отсутствуют");
    return str1;
}`*\
*3. Вызвать функции `str_array` и `slist`.*
